# YOLOv5n modified for nematode detection
# Based on YOLOv5 nano with optimizations for small object detection

# Parameters
nc: 1  # number of classes: Beet_Cysts
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25  # layer channel multiple

# Anchors - adjusted for smaller objects
anchors:
  - [8,10, 13,16, 19,23]  # P3/8 - smaller anchors for nematodes
  - [27,37, 44,38, 48,86]  # P4/16
  - [94,68, 128,153, 226,290]  # P5/32

# YOLOv5n backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],  # 2
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],  # 4
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],  # 6
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]],  # 8
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5n head with added detection level for small objects
head:
  [[-1, 1, Conv, [512, 1, 1]],  # 10
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 11
   [[-1, 6], 1, Concat, [1]],  # 12: cat backbone P4
   [-1, 3, C3, [512, False]],  # 13
   
   [-1, 1, Conv, [256, 1, 1]],  # 14
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 15
   [[-1, 4], 1, Concat, [1]],  # 16: cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)
   
   # Additional path for better small object detection
   [-1, 1, Conv, [128, 1, 1]],  # 18
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  # 19
   [[-1, 2], 1, Concat, [1]],  # 20: cat backbone P2 
   [-1, 3, C3, [128, False]],  # 21 (P2/4-micro)
   
   # Path back up
   [-1, 1, Conv, [256, 3, 2]],  # 22
   [[-1, 17], 1, Concat, [1]],  # 23
   [-1, 3, C3, [256, False]],  # 24 (P3/8-medium)
   
   [-1, 1, Conv, [512, 3, 2]],  # 25
   [[-1, 13], 1, Concat, [1]],  # 26
   [-1, 3, C3, [512, False]],  # 27 (P4/16-large)
   
   # Detection heads at three scales
   [[21, 24, 27], 1, Detect, [nc, anchors]],  # Detect(P2/4, P3/8, P4/16)
  ]